FILES/Enums/ТипыДополнительногоФункционала.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Enum>
		<Properties>
			<Name>ТипыДополнительногоФункционала</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>КомпонентСобытий</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КомпонентЗагрузкиДанных</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КомпонентВыгрузкиДанных</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КомпонентПечатнойФормы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КомпонентОтчета</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Системный</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

FILES/Catalogs/ДополнительныйФункционал.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Catalog>
		<Properties>
			<Name>ДополнительныйФункционал</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВнешняяОбработка</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеОбработки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РежимОтладки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПутьКФайлуОтладки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлючМодуля</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Версия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШаблонОписания</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПубличнаяКомпонента</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяСкриптаШины</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПриватныйСкрипт</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкриптШины</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипДопФункционала</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыДополнительногоФункционала</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МинимальнаяВерсияСистемы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МаксимальнаяВерсияСистемы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХешКомпоненты</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазрешитьОтправкуДанныхОбОшибкахРазработчикам</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоступенДляВыгрузкиВШину</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтключитьАвтоматическоеОбновление</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Стоимость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаТранзакцию</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>НастройкиСервера</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Ключ</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СписокОбрабатываемыхСобытий</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПутьКОбъектуМетаданных</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОбрабатываемоеСобытие</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДополнительноеДействие</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>25</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ИзображенияОписания</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СсылкаНаИзображениеВШине</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НазваниеИзображения</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Изображение</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

FILES/CommonModules/МаркетПлейсПовтИспользование/Ext/Module.bsl
Функция СписокДопФункционалаМП() Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДополнительныйФункционал.Ссылка КАК Ссылка,
		|	ДополнительныйФункционал.НаименованиеОбработки КАК НаименованиеОбработки,
		|	ДополнительныйФункционал.ТипДопФункционала КАК ТипДопФункционала
		|ИЗ
		|	Справочник.ДополнительныйФункционал КАК ДополнительныйФункционал
		|ГДЕ
		|	ДополнительныйФункционал.ПометкаУдаления = ЛОЖЬ
		|	И ДополнительныйФункционал.ТипДопФункционала = &ТипДопФункционала";
	Запрос.УстановитьПараметр("ТипДопФункционала", Перечисления.ТипыДополнительногоФункционала.КомпонентСобытий);
	
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выгрузить();
	
	Возврат ВыборкаДетальныеЗаписи; 
КонецФункции

Функция ОбработкаМП(ДополнительныйФункционал) Экспорт
	ОшибкаОбработки = Ложь;
	Если ДополнительныйФункционал.Ссылка.РежимОтладки Тогда
		//
		ВОбработка = ВнешниеОбработки.Создать(ДополнительныйФункционал.Ссылка.ПутьКФайлуОтладки, Ложь);
		ИмяОбработки = СтрЗаменить(Строка(ВОбработка), "ВнешняяОбработкаОбъект.", "");
	Иначе
		НавигационнаяССылка = ПолучитьНавигационнуюСсылку(ДополнительныйФункционал.Ссылка, "ВнешняяОбработка");
		
		Попытка
			ОбъектОписанияЗащиты = Новый ОписаниеЗащитыОтОпасныхДействий;
			ОбъектОписанияЗащиты.ПредупреждатьОбОпасныхДействиях = Ложь;
			ИмяОбработки = ВнешниеОбработки.Подключить(НавигационнаяССылка,,Ложь,ОбъектОписанияЗащиты); 
			ВОбработка = ВнешниеОбработки.Создать(ИмяОбработки, Ложь);
		Исключение	
			ОшибкаОбработки = Истина;
		КонецПопытки;
	КонецЕсли;
	
	Возврат Новый Структура("ОшибкаОбработки, ИмяОбработки, ВОбработка", ОшибкаОбработки, ИмяОбработки, ВОбработка);
КонецФункции

Функция ДобавитьСостав(Подсистемы, Подсистема)
	
	Для Каждого ЭлементСостава ИЗ Подсистема.Состав Цикл
		Подсистемы.Добавить(Строка(ЭлементСостава));		
	КонецЦикла;
	
	Для Каждого ЭлементПодсистемы ИЗ Подсистема.Подсистемы Цикл
		ДобавитьСостав(Подсистемы, ЭлементПодсистемы);
	КонецЦикла;
	
КонецФункции

Функция ПолучитьСписокОбъектовБТ() Экспорт
	
	Подсистемы = Новый Массив;
	ДобавитьСостав(Подсистемы, Метаданные.Подсистемы.БизнесТревел);
	ДобавитьСостав(Подсистемы, Метаданные.Подсистемы.АдминистрированиеБТ);
	ДобавитьСостав(Подсистемы, Метаданные.Подсистемы.ВнешниеСервисы);
	
	Возврат УправлениеБТВызовСервера.ВJSON(Подсистемы);
КонецФункции

Функция ОбъектФункционалБТ(ВесьСоставJSON, МетаданныеОбъекта) Экспорт
	
	ВесьСостав = УправлениеБТВызовСервера.ИзJSON(ВесьСоставJSON);
	ЗначениеПоиска = ВесьСостав.Найти(МетаданныеОбъекта);
	Возврат ЗначениеПоиска;
	
КонецФункции
